Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: དེ་ལ་ཕྱིར་མི་འོང་བའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the qualities of a non-returner?

source: འདོད་པ་ན་སྤྱོད་པའི་འདོད་ཆགས་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the relinquishment of desire associated with the desire realm.

source: མི་ལྟ་བའི་སེམས་དང་དེའི་ངོ་བོ་མ་ཡིན་པ་དང་ཕྱིར་མི་འོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as a mind that has no regard for that realm, the state of being fundamentally at odds with it, and not returning to it.

source: སྲིད་པ་བཟང་པོར་སྐྱེ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as excellent rebirth.

source: ཤིན་ཏུ་མཐོང་བར་སྐྱེ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as birth in the Gorgeous Heaven.

source: འོག་མིན་དུ་སྐྱེ་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as birth in the Unexcelled Heaven.

source: སྐྱེས་བུ་དམ་པའི་འགྲོ་བ་དྲུག་གི་ཤེས་པ་ཐག་རིང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟེ།
en: The perfection of insight ripens as the way holy beings distance themselves from the mind states of the six realms.

source: འདི་དག་ནི་ཕྱིར་མི་འོང་བའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the qualities of a non-returner.

source: དེ་ལ་དགྲ་བཅོམ་པའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the qualities of a worthy one?

source: དགྲ་བཅོམ་པ་ཡོངས་སུ་ཉམས་པའི་ཆོས་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as understanding the phenomena that prevent the level of a worthy one.

source: ཡོངས་སུ་ཉམས་པ་མེད་པའི་ཆོས་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as understanding of the flawless phenomena.

source: དད་པས་མོས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as being inspired by faith.

source: ཤེས་རབ་ཀྱིས་རྣམ་པར་གྲོལ་བ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as understanding liberation through insight.

source: ལུས་ཀྱིས་མངོན་དུ་བྱེད་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as understanding physical formation.

source: གཉི་གའི་ཆ་ལས་རྣམ་པར་གྲོལ་བ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟེ།
en: Insight ripens as understanding liberation from dual aspects.

source: འདི་དག་ནི་དགྲ་བཅོམ་པའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of a worthy one.

source: དེ་ལ་རང་སངས་རྒྱས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of a solitary buddha?

source: རང་སངས་རྒྱས་ལ་ཡིད་བྱུང་བ་ཆུང་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as seeing the lesser disenchantment of a solitary buddha.

source: ཡིད་བྱུང་ནས་འབྱོལ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as turning away based on disenchantment.

source: གཅིག་པུ་ལ་དགའ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as delighting in solitude.

source: ཐར་པ་ལ་དགའ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as delighting in liberation.

source: ཞི་གནས་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as dwelling in calm abiding.

source: གཅིག་པུ་སྤོབས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as solitary confidence.

source: འདི་དག་ནི་རང་སངས་རྒྱས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of a solitary buddha.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of a bodhisattva?

source: གཡོ་མེད་པར་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའིའོ། །
en: The perfection of generosity ripens as unflinching giving.

source: ལྷག་པའི་བསམ་པས་ཞུགས་པའི་སྦྱོར་བ་ནི་དཔེར་ན་ངང་པའི་སྐྱེས་པའི་རབས་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as engagement based on superior intent, as exemplified by the Bodhisattva’s life as a swan.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as a mind of equality with respect to all sentient beings.

source: ཤེས་པ་ཐམས་ཅད་རྣམ་པར་དཔྱོད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as discernment with respect to all cognitions.

source: གཞན་གྱིས་བསྒྲགས་པ་ལས་བརྟེན་ནས་སྙོམས་པར་འཇུག་པ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as understanding gained through meditative attainment rather than through the proclamations of others.

source: འཁོར་བ་ན་ཡོངས་སུ་སྐྱོ་བ་མེད་པའི་ཤེས་པ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as never becoming weary of saṃsāra while continuing to ripen sentient beings.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of a bodhisattva.

source: དེ་ལ་ཟད་པ་ཤེས་པས་རབ་ཏུ་ཕྱེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of discerning the knowledge of exhaustion?

source: ཟད་པ་ཤེས་པ་ལ་ཐོགས་པ་མེད་པར་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as attaining knowledge of exhaustion without impediment.

source: སྦྱོར་བ་ཆ་ཕྲ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as subtle engagement.

source: མཚན་ཉིད་མེད་པ་ལ་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as attaining the absence of characteristics.

source: ཡོངས་སུ་གཅོད་པའི་དམིགས་པ་ལ་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as engagement with the determined objective.

source: མི་ལྟ་བར་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as engagement in nonseeing.

source: མི་ཤེས་པ་ཐམས་ཅད་དང་བྲལ་ཞིང་ཤེས་པ་ཐམས་ཅད་རབ་ཏུ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as freedom from all aspects of ignorance and attainment of all aspects of knowledge.

source: འདི་དག་ནི་ཟད་པ་ཤེས་པས་རབ་ཏུ་ཕྱེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of discerning the knowledge of exhaustion.

source: དེ་ལ་མི་སྐྱེ་བ་ཤེས་པས་རབ་ཏུ་ཕྱེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of discerning the knowledge of nonarising?

source: སྲེད་པའི་རྩ་བ་དགུ་པོ་དག་མི་སྐྱེ་བར་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the knowledge of the ninefold root of craving.

source: གནོད་སེམས་ཀྱི་དངོས་པོ་དགུ་མི་སྐྱེ་བར་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the knowledge of the nonarising of the ninefold nature of ill will.

source: འཇིག་རྟེན་གྱི་ཆོས་ཀྱིས་མ་གཏུགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as being unblemished by mundane concerns.

source: རྣམ་པར་ཐར་པ་ཡོངས་སུ་མ་ཉམས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as unfailing liberation.

source: མི་སློབ་པའི་ཤེས་པ་བཅུ་པོ་དག་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the tenfold cognition of no more training.

source: ཡོངས་སུ་གཅོད་པར་འགྱུར་བ་མེད་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the understanding of unchangeable determination.

source: འདི་དག་ནི་མི་སྐྱེ་བ་ཤེས་པས་རབ་ཏུ་ཕྱེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of discerning the knowledge of nonarising.

source: དེ་ལ་བྱིན་གྱི་རླབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of blessings?

source: དམ་པའི་ཆོས་མ་ནུབ་ཀྱི་བར་དུ་ཆོས་ཐམས་ཅད་གནས་པ་དང་བསྟན་པ་ལ་ཟང་ཟིང་གིས་མཆོད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the presence of all the teachings for as long as the sacred Dharma endures, as well as the teachings as recipients of material worship.

source: བསྟན་པ་ལ་ཟིལ་གྱིས་མ་ནོན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the teachings not being defeated.

source: འཇིག་རྟེན་གྱི་རིགས་བཞི་དད་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the instilling of faith in the four castes of the world.

source: མངོན་པར་བརྩོན་པ་འབྲས་བུ་དང་བཅས་པར་རྩོལ་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as fruitful and diligent endeavors.

source: བསམ་པ་དེས་པས་ཆོས་མངོན་པར་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as realization of the Dharma based on noble intention.

source: འཇིག་རྟེན་གྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟེ།
en: The perfection of insight ripens as complete knowledge of all phenomena of the world.

source: འདི་དག་ནི་བྱིན་གྱི་རླབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of blessings.

source: དེ་ལ་ལྷའི་མིག་སྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of accomplishing the divine eye?

source: ལྷའི་མིག་གིས་གཟུགས་ཅན་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as seeing forms by means of the divine eye.

source: གཟུགས་ཅན་མ་ཡིན་པ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as seeing that which lacks form by means of the divine eye.

source: སྒྲོ་བཏགས་པ་མེད་པ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as seeing without superimposition.

source: འཁོར་བའི་ཉེས་དམིགས་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as seeing the flaws of existence.

source: ངེས་པར་འབྱུང་བ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as seeing deliverance.

source: ཉེ་བར་ཞི་བ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as seeing pacification.

source: འདི་དག་ནི་ལྷའི་མིག་སྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of accomplishing the divine eye.

source: དེ་ལ་ལྷའི་རྣ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “Which are the six perfections of the divine ear?

source: སྒྲ་ཆེ་བ་ཉན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as listening to greater sounds.

source: སྒྲ་ཆུང་བ་ཉན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as listening to smaller sounds.

source: བྱམས་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as loving kindness that is perfect in all regards.

source: ཐབས་ཀྱི་ཚིག་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the imparting of skillful words.

source: འདུ་བྱེད་རྣམས་ཐོས་ནས་ཀུན་དུ་འཛིན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the hearing and retaining of karmic formations.

source: སྒྲ་ཐམས་ཅད་དཔྱོད་པ་ལ་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the application of discernment with respect to all sounds.

source: འདི་དག་ནི་ལྷའི་རྣ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the divine ear.

source: དེ་ལ་སེམས་ཀྱི་རྣམ་གྲངས་ཤེས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of knowing the categories of mind?

source: སེམས་ཀྱི་རང་བཞིན་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as seeing the nature of mind.

source: སེམས་ལ་དགེ་བ་དང་མི་དགེ་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as seeing mind as wholesome and unwholesome.

source: སེམས་ཀྱི་རྒྱུ་དང་རྐྱེན་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as seeing the causes and conditions of the mind.

source: འདས་པ་དང་། མ་འོངས་པ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as seeing the past and the future.

source: ད་ལྟར་བྱུང་བ་ལ་མཉམ་པ་ཉིད་དུ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as seeing the equality of that which occurs in the present.

source: ཐམས་ཅད་དུ་རྒྱུ་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as seeing movement everywhere.

source: འདི་དག་ནི་སེམས་ཀྱི་རྣམ་གྲངས་ཤེས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of knowing the categories of mind.

source: དེ་ལ་སྔོན་གྱི་གནས་མཐོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of seeing past contexts?

source: སྔོན་གྱི་གནས་ན་བདེན་པའི་དམིགས་པ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as seeing the focal points of the truths in relation to past contexts.

source: སྐྱེ་བ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as understanding birth.

source: འགྲོ་བར་འཇུག་པ་མེད་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as understanding disengagement from the world of wandering beings.

source: དེ་ལྟ་བུ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as understanding the way things are.

source: དེ་ལྟར་བདག་མེད་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as seeing things to be devoid of self.

source: རྣམ་པས་ལུང་འབོགས་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as seeing the imparting of statements.

source: འདི་དག་ནི་སྔོན་གྱི་གནས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of seeing past contexts.

source: དེ་ལ་རྫུ་འཕྲུལ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of miraculous power?

source: རྫུ་འཕྲུལ་གྱི་ཤུགས་རབ་ཏུ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the attainment of miraculous power.

source: དམིགས་པ་ཐ་དད་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the absence of distinct objective references.

source: སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེས་རྣམ་པར་འཕྲུལ་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as compassionate displays for sentient beings.

source: ཡིད་ཀྱི་ལས་མི་ལྡོག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as unstoppable acts of the mind.

source: ཟིལ་གྱིས་མ་ནོན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as being indomitable.

source: འདི་དག་ནི་རྫུ་འཕྲུལ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of miraculous power.

source: དེ་ལ་ཟག་པ་ཟད་པར་ཤེས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the knowledge of exhaustion?

source: ཟག་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as seeing the contaminants.

source: ཟག་པ་ཀུན་འབྱུང་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as seeing the genesis of the contaminants.

source: ཟག་པ་འགོག་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as seeing the cessation of the contaminants.

source: ཟག་པ་འགོག་པར་འགྱུར་བའི་ལམ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as seeing the path of the cessation of the contaminants.

source: འདི་ཉིད་དུ་ཟག་པ་བཅུ་མ་ལུས་པར་འགོག་པར་ལྟ་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as viewing the cessation of all ten contaminants without exception.

source: འདི་ཉིད་དུ་ཟག་པ་བཅོམ་ནས་མི་སྣང་བར་འགྱུར་བ་གང་ཡིན་པ་དང་། དེ་ལྟར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as crushing the contaminants, so they become invisible, and the vision pertaining to that.

source: འདི་དག་ནི་ཟག་པ་ཟད་པ་ཤེས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the knowledge of exhaustion.

source: དེ་ལ་སྤྱོད་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན། །
en: “What are the six perfections of conduct?

source: སྐྱེ་བོ་མང་པོ་དད་པར་བྱེད་པའི་སྤྱོད་ལམ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as a code of conduct that inspires faith in many people.

source: ཀུན་ནས་མཛེས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as beauty in all its forms.

source: རྒྱུན་མི་འཆད་པར་བལྟས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as uninterrupted concern.

source: གོམ་པ་འདོར་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as taking steps.

source: སྤྱོད་ལམ་མ་ཉམས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as equality in conduct.

source: སྤྱོད་ལམ་མ་བཅོས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as uncontrived conduct.

source: འདི་དག་ནི་སྤྱོད་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of conduct.

source: དེ་ལ་ཕན་པར་འདོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of wishing to benefit?

source: སྤྱོད་པ་ཡང་བར་ཟང་ཟིང་ལེན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as utilizing material things in trivial activities.

source: སེམས་ཅན་མ་རུངས་པ་དག་ལ་སྐྱབས་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as saving evil sentient beings.

source: མུ་སྟེགས་ཅན་རྣམས་ཀྱི་གནོད་པ་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as bearing with the harms inflicted by non-Buddhists.

source: འདི་ལྟར་གདུལ་བའི་ཕྱིར་དགའ་བོ་ལྷའི་ནང་དུ་སོན་པ་དང་། འདི་ལྟར་པད་མའི་སྙིང་པོའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens in the way exemplified by Nanda, who entered among the gods for the sake of the training, or as exemplified by Lotus Essence.

source: གདུལ་བའི་ཕྱིར་བཟང་བརྩམས་སྒོམ་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the cultivation of excellent endeavor for the sake of the training.

source: འདི་ལྟར་ལྔ་པོའི་ནང་ནས་ཀུན་ཤེས་སྙིང་རྗེས་ཉེ་བར་འོངས་ཏེ་ཆོས་བསྟན་པ་དང་། འདི་ལྟར་བདེན་པ་པོའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as teaching the Dharma with understanding and compassion to the five mendicants and thereby showing the truth.

source: འདི་དག་ནི་ཕན་པར་འདོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of wishing to benefit.

source: དེ་ལ་ཉོན་མོངས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the absence of defilement?

source: ཉོན་མོངས་པས་ཡོངས་སུ་སྐྱོ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as not being deterred by defilements.

source: དབང་རབ་ཏུ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as receiving anointment.

source: གནོད་སེམས་མེད་པར་གནས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as remaining free from ill will.

source: མོས་པ་ལ་ཡོན་སྦྱོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as giving gifts to the devoted.

source: མངོན་པར་ཞེན་པ་མེད་པར་རྟག་ཏུ་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as constant application free from attachment.

source: ཇི་ལྟར་འདོད་པ་བཞིན་གནས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as being just the way one wishes to be.

source: འདི་དག་ནི་ཉོན་མོངས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the absence of defilement.

source: དེ་ལ་ཚེའི་འདུ་བྱེད་འདོར་བ་ལ་དབང་སྒྱུར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of mastering the relinquishment of the factors for staying alive?

source: ཚེ་འདོར་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །བོར་ནས་
en: Generosity ripens as the relinquishment of one’s life.

source: གནས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as remaining after relinquishment.

source: མཚམས་བཅད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as termination.

source: ལྟ་བར་སོང་བའི་སྲིད་པ་ཐམས་ཅད་སྤངས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the relinquishment of all forms of existence that involve views.

source: སེམས་ཅན་སྨིན་པར་བྱ་བའི་ཕྱིར་བཏང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as relinquishment in order to benefit sentient beings.

source: སེམས་ཅན་ཡིད་བྱུང་བ་རྣམས་གདུལ་བའི་ཕྱིར་བཏང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as relinquishment for the sake of appeasing the dejected.

source: འདི་དག་ནི་ཚེའི་འདུ་བྱེད་འདོར་བ་ལ་དབང་སྒྱུར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of mastering the relinquishment of the factors for staying alive.

source: ལེན་པ་མེད་པར་མྱ་ངན་ལས་འདས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as nirvāṇa without remainder.

source: སེམས་ཀྱི་བྱིན་གྱིས་བརླབས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the blessing of the mind.

source: འོད་སྲུང་ཆེན་པོ་མཐོང་བར་སྒྲུབ་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as accomplishing the perception of Mahākāśyapa.

source: སྟོང་གསུམ་གཡོ་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as shaking the trichiliocosm.

source: སེམས་ལ་འཇོག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as resting the mind.

source: རིང་བསྲེལ་སེལ་བུར་བླགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as breaking up into distinct relics.

source: དེ་ལ་ཆོ་འཕྲུལ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of miraculous display?

source: ཕྱོགས་ཐ་དད་པ་དག་ཏུ་སྐུ་གདུང་རྣམས་འཐོར་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the distribution of relics to various locations.

source: སྐུ་གདུང་གི་ཆོ་འཕྲུལ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the miraculous displays of relics.

source: སེམས་ཅན་རྣམས་དང་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as uplifting and inspiring the minds of sentient beings.

source: ཆོ་འཕྲུལ་ལ་ལྷ་རྣམས་སྤྲོ་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the emanation of deities in miraculous displays.

source: སྤུ་ཟིང་ཞེས་བྱེད་ཅིང་མཆི་མ་འཛག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as body hairs standing on end and tears falling.

source: བདེན་པའི་ཚིག་གིས་རིང་བསྲེལ་ལས་ཆོ་འཕྲུལ་འབྱུང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as words of truth causing miraculous displays to emerge from relics.

source: འདི་དག་ནི་ཆོ་འཕྲུལ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of miraculous display.

source: དེ་ལ་བསྟན་པ་རྣམ་པར་དབྱེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of delivering teachings?

source: རྙེད་པ་རབ་ཏུ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as attainment of gains.

source: ཁ་ན་མ་ཐོ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as being free from evil.

source: ཟིལ་གྱིས་མ་ནོན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as being indomitable.

source: ཇི་ཙམ་དུ་ལྷ་དང་མིས་བསྟན་པ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as gods and humans attaining teachings.

source: བདུད་ཀྱིས་བལྟར་མེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as being invisible to the māras.

source: བསྟན་པ་དང་བྲལ་བར་དགའ་ཞིང་དང་བ་ཙམ་གྱིས་མཐར་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as finally attaining nirvāṇa through joy and inspiration without teaching.

source: འདི་དག་ནི་བསྟན་པ་རྣམ་པར་དབྱེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of delivering teachings.

source: དེ་ལ་རིང་བསྲེལ་རྣམ་པར་དབྱེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of bringing forth relics?

source: རིང་བསྲེལ་རྣམས་ལ་ཡོ་བྱད་ཀྱིས་མཆོད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའིའོ། །
en: Generosity ripens as worship of relics by means of material articles.

source: སྐྱེ་བོ་མང་པོ་དད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as numerous people having faith.

source: རིང་བསྲེལ་གྱི་མཆོད་རྟེན་གཟི་བྱིན་ཅན་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as splendid stūpas containing relics.

source: ལྷ་དང་མི་རྣམས་དགའ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the rejoicing of gods and humans.

source: རིང་བསྲེལ་གྱི་དམིགས་པ་ལས་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་རབ་ཏུ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as recollection of the buddhas based on observation of the relics.

source: རིང་བསྲེལ་ཚོལ་བས་སྤོབས་པ་ཡོངས་སུ་མ་ཉམས་པ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟེ།
en: Insight ripens as the attainment of imperishable acumen through the pursuit of relics.

source: འདི་དག་ནི་རིང་བསྲེལ་རྣམ་པར་དབྱེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of bringing forth relics.

source: དེ་དག་ལས་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉིས་སྟོང་ཆིག་བརྒྱ་ནི་འདོད་ཆགས་སྤྱོད་པ་རྣམས་ལ་ཆོས་སྟོན་པའོ། །
en: “Apart from those perfections there are two thousand one hundred perfections that are Dharma teachings to those who experience desire,

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉིས་སྟོང་ཆིག་བརྒྱ་ནི་ཞེ་སྡང་སྤྱོད་པ་རྣམས་ལ་ཆོས་སྟོན་པའོ། །
en: two thousand one hundred that are Dharma teachings to those who experience anger,

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉིས་སྟོང་ཆིག་བརྒྱ་ནི་གཏི་མུག་སྤྱོད་པ་རྣམས་ལ་ཆོས་སྟོན་པའོ། །
en: two thousand one hundred that are Dharma teachings to those who experience dullness,

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉིས་སྟོང་ཆིག་བརྒྱ་ནི་ཆ་མཉམ་པར་སྤྱོད་པ་རྣམས་ལ་ཆོས་སྟོན་པ་སྟེ།
en: and two thousand one hundred that are Dharma teachings to those who experience those three in equal measure.

source: དེ་དག་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བརྒྱད་སྟོང་བཞི་བརྒྱའོ། །
en: Thus, there are eight thousand four hundred such perfections.
